Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/back_to_education/education_training_and_development_option.html.txt.tmx
Source language: en
Languages: ga

source: Education, Training and Development Option
ga: Rogha Oideachais, Oiliúna agus Forbartha

source: Under the Education, Training and Development Option you may continue to get your Jobseeker’s Allowance or Jobseeker’s Benefit while attending certain short education, training or development
ga: Má bhíonn tú páirteach sa Rogha Oideachais, Oiliúna agus Forbartha féadfaidh tú leanúint ar aghaidh ag fáil do Liúntas Cuardaitheora Poist nó do Sochar Cuardaitheora Poist fad is atá tú ag freastal ar chúrsaí áirithe oideachais, oiliúna nó forbartha

source: Your Intreo centre may make special signing-on arrangements so that you can attend your chosen course
ga: Féadfaidh d’Oifig Leasa Shóisialaigh áitiúil socruithe speisialta saighneála a dhéanamh duit chun go bhféadfaidh tú freastal ar do chúrsa

source: The Education, Training and Development Option is an administrative scheme
ga: Scéim riaracháin is ea an Rogha Oideachais, Oiliúna agus Forbartha

source: However you can seek a review of a decision. This will be made by an officer of the Department of Social Protection not involved in the decision being reviewed or by a more senior officer
ga: Ciallaíonn sé sin nach féidir leat achomharc a dhéanamh in aghaidh cinnidh chuig an Oifig Achomhairc Leasa Shóisialaigh má dhiúltaítear an rogha seo a thabhairt duit

source: To qualify for the Education, Training and Development Option and keep your Jobseeker’s Allowance or Jobseeker's Benefit you must be:
ga: Le bheith incháilithe i gcomhair Rogha Oideachais, Oiliúna agus Forbartha agus do Liúntas Cuardaitheora Poist nó do Shochar Cuardaitheora Poist a choinneáil ní mór duit:

source: • At least 21 years of age or
ga: • A bheith 21 bliain d’aois ar a laghad nó

source: • Between 18 and 20 and out of the formal education system for at least 2 years
ga: • Idir 18 agus 20 bliain d’aois agus a bheith imithe ón gcóras foirmiúil oideachais ar feadh 2 bhliain ar a laghad

source: • Have been getting Jobseeker's Allowance, Jobseeker's Benefit or signing on for unemployment credits for at least 6 months (156 days)
ga: • A bheith ag fáil Liúntais Cuardaitheora Poist nó Sochair Cuardaitheora Poist, nó a bheith ag saighneáil le haghaidh pointí creidmheasa le sé mhí ar a laghad (156 lá)

source: The Education, Training and Development Option allows you to attend short courses , typically no longer than 10 weeks
ga: Is iad na cúrsaí atá clúdaithe sa Rogha Oideachais, Oiliúna agus Forbartha ná na cúrsaí sin nach gclúdaítear faoi scéim Liúntas um Fhilleadh ar an Oideachas

source: For example, courses may be one-day courses, half-day courses for a number of weeks or evening courses
ga: Caithfidh tú a thaispeáint go mbeidh deis níos fearr agat jab a fháil de bharr an chúrsa a dhéanamh

source: You must be able to show that the course chosen will improve your chances of getting a job
ga: Áirítear cúrsaí mar seo a leanas mar chúrsaí a bhféadfá páirt a ghlacadh iontu:

source: • Specific job skills courses
ga: • Cúrsaí i gcomhair scileanna faoi leith le haghaidh jabanna

source: The course must be approved by a case officer and should form part of your DSP Personal Progression Plan
ga: Caithfidh éascaitheoir an cúrsa a fhaomhadh

source: You can arrange an appointment with a case officer by contacting your Intreo centre- see 'Where to apply' below
ga: Féadfaidh tú coinne a dhéanamh bualadh le héascaitheoir trí theagmháil a dhéanamh le d’Oifig Leasa Shóisialaigh áitiúil - féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos

source: To find out about available courses and get advice on how to get a place on the course of your choice, you should contact your local ETB, school or college, public library or Citizens Information Service
ga: Chun fáil amach faoi na cúrsaí atá ar fáil agus chun comhairle a fháil faoi conas áit a fháil ar do rogha cúrsa, ba chóir duit dul i dteagmháil le do Boird Oideachais agus Oiliúna (BOOnna) áitiúil a dhéanamh, scoil, coláiste nó leabharlann phoiblí áitiúil nó leis an Ionad Faisnéise do Shaoránaigh

source: You will continue to get your weekly Jobseeker’s Allowance or Jobseeker’s Benefit at your usual rate and any other secondary benefits
ga: Gheobhaidh tú do Liúntas Cuardaitheora Poist nó do Shochar Cuardaitheora Poist gach seachtain i gcónaí agus aon sochair thánaisteacha ag an gnáthráta

source: Secondary benefits may include:
ga: D’fhéadfadh rudaí mar seo a leanas a bheith san áireamh mar shochair thánaisteacha:

source: • Rent Supplement and Mortgage Interest Supplement
ga: • Forlíonadh Cíosa agus Fordheontas Ús Morgáiste

source: However, out of pocket expenses, may affect the amount of Rent Supplement or Mortgage Interest Supplement you are getting
ga: D’fhéadfadh tionchar a bheith ag costais as póca, áfach, ar mhéid an Fhorlíonaidh Cíosa nó an Fhordheontais Ús Morgáiste atá á fháil agat

source: Signing for unemployment credits
ga: Saighneáil chun creidmheasanna dífhostaíochta a fháil

source: If you have been signing on for unemployment credits, you will continue to get credits while you are participating in the Education, Training and Development Option
ga: Má bhí tú ag saighneáil i gcomhair creidmheasanna dífhostaíochta leanfaidh tú ort ag fáil na gcreidmheasanna chomh fada is atá tú ag glacadh páirte sa Rogha Oideachais, Oiliúna agus Forbartha

source: All applications for the Back to Education - Education, Training and Development Option should be made on form BTE1(pdf)
ga: Ba chóir gach iarratas le haghaidh an Rogha Oideachais, Oiliúna agus Forbartha a dhéanamh ar an bhfoirm BTE1

source: You will be asked to provide information about your course, for example:
ga: Iarrfar ort faisnéis a chur ar fáil faoi do chúrsa, mar shampla:

source: • Written confirmation from the relevant organisation or school that you have registered for the course
ga: • Dearbhú scríofa ón eagraíocht nó ón scoil bhainteach go bhfuil tú cláraithe ar an gcúrsa

source: • You may be asked for confirmation of on-going course attendance
ga: • B’fhéidir go n-iarrfar ort dearbhú a sholáthar go bhfuil tú ag freastal ar an gcúrsa

source: • You are also required to notify the Department when you finish the course
ga: • Lena chois sin beidh ort a chur in iúl don Roinn nuair a bheith an cúrsa críochnaithe agat

source: Apply for the Education, Training and Development Option at your Intreo centre or DSP office
ga: Déan iarratas ar Rogha Oideachais, Oiliúna agus Forbartha ag d'Ionaid Intreo ó d’Oifig Áitiúil Leasa Shóisialaigh
